000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаБрокеры/КафкаБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаБрокеры</name>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПодключения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимПароля</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаБрокеры/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыПодключения = Неопределено Тогда
		ПараметрыПодключения = Новый ФиксированноеСоответствие(Новый Соответствие);
	КонецЕсли;
	
	СвойстваLibrdKafka = КафкаИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("*");
	
	ЗаполнитьЗначенияПредставления();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыПодключения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ТекущийОбъект.Ссылка,
		"ПараметрыПодключения"); // ФиксированноеСоответствие
	УстановитьПривилегированныйРежим(Ложь); 
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого Параметр Из ТекущийОбъект.ПараметрыПодключения Цикл
		Если Параметр.РежимПароля Тогда
			Параметр.Значение = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПараметрыПодключения,
		"ПараметрыПодключения");
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУзлы

&НаКлиенте
Процедура УзлыПриИзменении(Элемент)
	
	СброситьРезультатПроверкиПодключения();
	
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УзлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;

	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	Если Копирование И Не Элемент.ТекущиеДанные = Неопределено Тогда
		НоваяСтрока.Адрес = Элемент.ТекущиеДанные.Адрес;
	КонецЕсли;

	Элементы.Узлы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.Узлы.ТекущийЭлемент = Элементы.УзлыАдрес;
	Элементы.Узлы.ИзменитьСтроку();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПодключения

&НаКлиенте
Процедура ПараметрыПодключенияПриАктивизацииСтроки(Элемент)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
	Элементы.ПараметрыПодключенияРежимПароля.Доступность = Ложь;
	ТекущиеДанные = Элементы.ПараметрыПодключения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Свойство = СвойстваLibrdKafka.Получить(ТекущиеДанные.Ключ); // см. КафкаИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		Если Свойство <> Неопределено И Свойство.ТипЗначения = "string" Тогда
			Элементы.ПараметрыПодключенияРежимПароля.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПриИзменении(Элемент)
	
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущиеДанные = Неопределено Или ТекущиеДанные = Неопределено Или Не ТекущиеДанные.РежимПароля Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Соответствие(ПараметрыПодключения);
	Данные.Удалить(ТекущиеДанные.Ключ);
	ПараметрыПодключения = Новый ФиксированноеСоответствие(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКлючПриИзменении(Элемент)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияЗначениеПредставлениеПриИзменении(Элемент)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	КафкаИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущиеДанные = Неопределено Или ТекущиеДанные = Неопределено
		Или Элемент.ТекущийЭлемент <> Элементы.ПараметрыПодключенияЗначениеПредставление
		Или Не ТекущиеДанные.РежимПароля Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ЗначениеПредставление = ПараметрыПодключения.Получить(ТекущиеДанные.Ключ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущиеДанные = Неопределено Или ТекущиеДанные = Неопределено
		Или Элемент.ТекущийЭлемент <> Элементы.ПараметрыПодключенияЗначениеПредставление
		Или Не ТекущиеДанные.РежимПароля Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Соответствие(ПараметрыПодключения);
	Данные.Вставить(ТекущиеДанные.Ключ, ТекущиеДанные.ЗначениеПредставление);
	ПараметрыПодключения = Новый ФиксированноеСоответствие(Данные);
	
	ТекущиеДанные.ЗначениеПредставление = "****************";
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияРежимПароляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПодключения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Соответствие(ПараметрыПодключения);
	Если ТекущиеДанные.РежимПароля Тогда
		Данные.Вставить(ТекущиеДанные.Ключ, ТекущиеДанные.Значение);
		ТекущиеДанные.Значение = "****************";
		
	Иначе
		ТекущиеДанные.Значение = Данные.Получить(ТекущиеДанные.Ключ);
		Данные.Удалить(ТекущиеДанные.Ключ);
		
	КонецЕсли;
	ПараметрыПодключения = Новый ФиксированноеСоответствие(Данные);
	
	ТекущиеДанные.ЗначениеПредставление = ТекущиеДанные.Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ОтключитьОбработчикОжидания("СброситьРезультатПроверкиПодключения");
	
	СброситьРезультатПроверкиПодключения();
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОтветПроверки = НачатьПроверкуПодключенияКБрокеру();

	ПроверитьПодключениеЗавершение(ОтветПроверки, Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СброситьРезультатПроверкиПодключения() Экспорт
	
	Для Каждого Узел Из Объект.Узлы Цикл
		Узел.Доступен = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеЗавершение(РезультатПроверки, ДополнительныеПараметры) Экспорт
	
	Если РезультатПроверки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Статусы = РезультатПроверки.Статусы;
	Для Каждого Узел Из Объект.Узлы Цикл
		Узел.Доступен = ?(Статусы.Получить(Узел.Адрес) = Истина, 1, -1);
	КонецЦикла;
	Элементы.Узлы.Обновить();
	ПодключитьОбработчикОжидания("СброситьРезультатПроверкиПодключения", 10, Истина);
	
	ЖурналПроверкиПодключения = РезультатПроверки.ТекстЖурнала;
	Элементы.ГруппаЖурналПроверкиПодключения.Доступность = Истина;;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Использование=НЕТ -> НейтральноСерый
	ДобавитьУсловноеОформлениеУзла(WebЦвета.НейтральноСерый, Ложь, Неопределено);
	
	// Использование=ДА&Доступен=-1 -> Красный
	ДобавитьУсловноеОформлениеУзла(WebЦвета.Красный, Истина, -1);
	
	// Использование=ДА&Доступен=0 -> ЦветТекстаФормы
	ДобавитьУсловноеОформлениеУзла(ЦветаСтиля.ЦветТекстаФормы, Истина, 0);
	
	// Использование=ДА&Доступен=1 -> Зеленый
	ДобавитьУсловноеОформлениеУзла(WebЦвета.Зеленый, Истина, 1);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеУзла(Цвет, Использование, Доступен = Неопределено)
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	// Оформление
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Цвет);
	
	// Поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.Узлы.Имя);
	
	// Отбор:Использование
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Узлы.Использование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Использование;
	
	// Отбор:Доступен
	Если Не Доступен = Неопределено Тогда
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Узлы.Доступен");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Доступен;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Если СвойстваLibrdKafka = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.ПараметрыПодключения Цикл // ТекущийОбъект
		
		Если Строка.РежимПароля Тогда
			Строка.Значение = "****************";
		КонецЕсли;
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. КафкаИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НачатьПроверкуПодключенияКБрокеру()
	
	Свойства = Новый Соответствие; // Соответствие Из Строка
	Для Каждого Параметр Из Объект.ПараметрыПодключения Цикл
		Свойства.Вставить(Параметр.Ключ, ?(Параметр.РежимПароля,
			ПараметрыПодключения.Получить(Параметр.Ключ), Параметр.Значение));
	КонецЦикла;
	
	Узлы = Новый Массив; // Массив Из Строка
	Для Каждого Узел Из Объект.Узлы Цикл
		Если Узел.Использование Тогда
			Узлы.Добавить(Узел.Адрес);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КафкаИнтеграцияСлужебный.ПроверитьПодключениеКБрокеруВФоне(Узлы, Свойства);

КонецФункции

#КонецОбласти
